## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 9 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_apigatewayv2_api.api_wskt will be created
  + resource "aws_apigatewayv2_api" "api_wskt" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Proxy to handle websocket requests to our API"
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "api-gatewayv2-websocket"
      + protocol_type                = "WEBSOCKET"
      + route_selection_expression   = "$request.body.action"
      + tags                         = {
          + "CostCenter" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all                     = {
          + "CostCenter" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_apigatewayv2_integration.api_wskt_integ will be created
  + resource "aws_apigatewayv2_integration" "api_wskt_integ" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:806545929748:function:api/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.api_wskt_route_connect will be created
  + resource "aws_apigatewayv2_route" "api_wskt_route_connect" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$connect"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.api_wskt_route_default will be created
  + resource "aws_apigatewayv2_route" "api_wskt_route_default" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.api_wskt_route_disconnect will be created
  + resource "aws_apigatewayv2_route" "api_wskt_route_disconnect" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$disconnect"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_stage.api_wskt_stage will be created
  + resource "aws_apigatewayv2_stage" "api_wskt_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = "$context.identity.sourceIp [$context.requestTime] \"$context.httpMethod $context.path $context.protocol\" $context.status $context.responseLength $context.requestId"
        }

      + default_route_settings {
          + data_trace_enabled       = false
          + detailed_metrics_enabled = false
          + logging_level            = (known after apply)
          + throttling_burst_limit   = 10
          + throttling_rate_limit    = 1
        }
    }

  # aws_cloudwatch_log_group.api_wskt_access will be created
  + resource "aws_cloudwatch_log_group" "api_wskt_access" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api-gatewayv2/api-wskt-access"
      + retention_in_days = 14
      + tags              = {
          + "CostCenter" = "scan-files-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCenter" = "scan-files-production"
          + "Terraform"  = "true"
        }
    }

  # aws_lambda_permission.apigatewayv2 will be created
  + resource "aws_lambda_permission" "apigatewayv2" {
      + action        = "lambda:InvokeFunction"
      + function_name = "api"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowAPIGatewayV2Invoke"
    }

  # module.api.aws_lambda_permission.api_gateway[0] must be replaced
-/+ resource "aws_lambda_permission" "api_gateway" {
      ~ id            = "AllowAPIGatewayInvoke" -> (known after apply)
      ~ source_arn    = "arn:aws:apigateway:ca-central-1::/restapis/zjyu1t6h7e" -> "arn:aws:execute-api:ca-central-1:806545929748:zjyu1t6h7e/*/*" # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 9 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_api.api_wskt"]
WARN - plan.json - main - Missing Common Tags: ["aws_apigatewayv2_stage.api_wskt_stage"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_wskt_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.write_waf_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.waf_log_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.scan-files"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_waf"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_cloudwatch_log_group.flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_flow_log.flow_logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_iam_policy.vpc_metrics_flow_logs_write_policy[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.vpc.aws_iam_role.flow_logs[0]"]

29 tests, 8 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
